___

<a href='http://www.pieriandata.com'><img src='../Pierian_Data_Logo.png'/></a>
___
<center><em>Copyright Pierian Data</em></center>
<center><em>For more information, visit us at <a href='http://www.pieriandata.com'>www.pieriandata.com</a></em></center>

# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of **a DataFrame as a bunch of Series objects put together to share the same index**. Let's use pandas to explore this topic!

In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn
np.random.seed(101)

# You can create a DF from 1:
Dict of series: The column names will be the keys - The index will be the union set of indexes of the series

In [111]:
d = {'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']),'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}
pd.DataFrame(d)

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

# You can create a DF from 2:
Dict of ndarrays/lists: The column names will be the keys - The index will be default 0 to n - 1

In [112]:
d = {'one': [1., 2., 3., 4.],'two': [4., 3., 2., 1.]}
pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

# You can create a DF from 3:
pd.Series but with the columns argument, by default the index and the columns names will be range(0,n) if it is not a dictionary or a Series or other DF

In [113]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split()) 
df2 = pd.DataFrame(randn(5,4))

In [33]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [34]:
df['W'] # This will be a pandas.core.series.Series

A    0.386030
B    0.681209
C   -1.005187
D   -1.382920
E    0.992573
Name: W, dtype: float64

In [35]:
type(df[['W']]) # This will be a pandas.core.frame.DataFrame: It need a List as input for that

pandas.core.frame.DataFrame

In [36]:
# Pass a list of column names
df[['W','Z']]

          W         Z
A  0.386030  0.230336
B  0.681209  1.939932
C -1.005187 -0.732845
D -1.382920 -2.141212
E  0.992573  1.292765

In [37]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

A    0.386030
B    0.681209
C   -1.005187
D   -1.382920
E    0.992573
Name: W, dtype: float64

DataFrame Columns are just Series

In [38]:
type(df['W'])

pandas.core.series.Series

### Creating a new column:

In [39]:
df['new'] = df['W'] + df['Y']

In [40]:
df

          W         X         Y         Z       new
A  0.386030  2.084019 -0.376519  0.230336  0.009512
B  0.681209  1.035125 -0.031160  1.939932  0.650049
C -1.005187 -0.741790  0.187125 -0.732845 -0.818062
D -1.382920  1.482495  0.961458 -2.141212 -0.421462
E  0.992573  1.192241 -1.046780  1.292765 -0.054206

### Removing Columns

In [41]:
df.drop('new',axis=1) # drop by default is axis=0 so a row removed by the index, it is not inplace by default

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [42]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A  0.386030  2.084019 -0.376519  0.230336  0.009512
B  0.681209  1.035125 -0.031160  1.939932  0.650049
C -1.005187 -0.741790  0.187125 -0.732845 -0.818062
D -1.382920  1.482495  0.961458 -2.141212 -0.421462
E  0.992573  1.192241 -1.046780  1.292765 -0.054206

In [43]:
df.drop('new',axis=1,inplace=True)

In [44]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

Can also drop rows this way:

In [45]:
df.drop('E',axis=0) # df.drop('E') would drop the row because by default is axis = 0

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212

### Selecting Rows
.loc is not a method but an attribute

In [28]:
df.loc['A'] # loc is to locate using the index => It returns a pandas series (remember they can have different types)

W   -0.993263
X    0.196800
Y   -1.136645
Z    0.000366
Name: A, dtype: float64

In [47]:
df2.loc[0] # The type has to be the same as in the index, so if it is numeric loc will work with integers too

0   -1.467514
1   -0.494095
2   -0.162535
3    0.485809
Name: 0, dtype: float64

Or select based off of position instead of label

In [48]:
df.iloc[2] # integer location

W   -1.005187
X   -0.741790
Y    0.187125
Z   -0.732845
Name: C, dtype: float64

### Selecting subset of rows and columns

In [50]:
df.loc['B','Y'] # Like for a ND-array, it is like [row(index) , column(name of columns)] => One element

-0.031160481493099617

In [51]:
df2.loc[0,2]

-0.1625347347726149

In [63]:
df.loc[['A','B'],['W','Y']] # Multiple slicing, first argument and second argument as list of values to extract

          W         Y
A  0.386030 -0.376519
B  0.681209 -0.031160

In [68]:
df.loc[['A','B']][['W','Y']] # Using chain operations (like data.table in R)

          W         Y
A  0.386030 -0.376519
B  0.681209 -0.031160

In [69]:
df.iloc[[0,3]] # This is equal to df.iloc[[0,3],:]

         W         X         Y         Z
A  0.38603  2.084019 -0.376519  0.230336
D -1.38292  1.482495  0.961458 -2.141212

In [70]:
print(df2)
df2.loc[[1,3],[1,3]] # df2.loc[[1,3]][[1,3]]: The chain operations also work in pandas

          0         1         2         3
0 -1.467514 -0.494095 -0.162535  0.485809
1  0.392489  0.221491 -0.855196  1.541990
2  0.666319 -0.538235 -0.568581  1.407338
3  0.641806 -0.905100 -0.391157  1.028293
4 -1.972605 -0.866885  0.720788 -1.223082

          1         3
1  0.221491  1.541990
3 -0.905100  1.028293

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [66]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [72]:
df>0 # It broadcasts to all the elements (the types non-comparable will return NaN), it OVERLOADS the operator returning a DF too

       W      X      Y      Z
A   True   True  False   True
B   True   True  False   True
C  False  False   True  False
D  False   True   True  False
E   True   True  False   True

In [73]:
df[df>0] # This receives a DF as filter of booleans so it is element wise

          W         X         Y         Z
A  0.386030  2.084019       NaN  0.230336
B  0.681209  1.035125       NaN  1.939932
C       NaN       NaN  0.187125       NaN
D       NaN  1.482495  0.961458       NaN
E  0.992573  1.192241       NaN  1.292765

In [75]:
df['W'] > 0 # This returns a pandas.core.serie.Series class

pandas.core.series.Series

In [77]:
df[df['W']>0] # It filters using pandas series, so in a row-wise manner

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
E  0.992573  1.192241 -1.046780  1.292765

In [83]:
df.loc['A'] > 0# This also returns a pandas series but with the index beeing the column names

W     True
X     True
Y    False
Z     True
Name: A, dtype: bool

In [86]:
df[df.loc['A'] > 0] # This returns an error, if it receives a Series assumes that is for the index(rows) so the index of the serie has to match with the one of the DF

/Users/gonzalopolo/.conda/envs/pytorchenv/lib/python3.7/site-packages/ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

IndexingError: Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match

In [89]:
df[df['W']>0]['Y'] # Chaining operations, selecting a column

A   -0.376519
B   -0.031160
E   -1.046780
Name: Y, dtype: float64

In [90]:
df[df['W']>0][['Y','X']] # Chaining operations, selecting multiple columns

          Y         X
A -0.376519  2.084019
B -0.031160  1.035125
E -1.046780  1.192241

For two conditions you can **use | and & with parenthesis**, the **python 'and' and 'or' operator** are not overloaded for pandas.Series so you must stick with & and |

In [92]:
df[(df['W']>0) & (df['Y'] > 1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [27]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [93]:
# Reset to default 0,1...n index
df.reset_index() # The index column will be just a column

  index         W         X         Y         Z
0     A  0.386030  2.084019 -0.376519  0.230336
1     B  0.681209  1.035125 -0.031160  1.939932
2     C -1.005187 -0.741790  0.187125 -0.732845
3     D -1.382920  1.482495  0.961458 -2.141212
4     E  0.992573  1.192241 -1.046780  1.292765

In [94]:
newind = 'CA NY WY OR CO'.split()

In [95]:
df['States'] = newind

In [96]:
df

          W         X         Y         Z States
A  0.386030  2.084019 -0.376519  0.230336     CA
B  0.681209  1.035125 -0.031160  1.939932     NY
C -1.005187 -0.741790  0.187125 -0.732845     WY
D -1.382920  1.482495  0.961458 -2.141212     OR
E  0.992573  1.192241 -1.046780  1.292765     CO

In [97]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.386030  2.084019 -0.376519  0.230336
NY      0.681209  1.035125 -0.031160  1.939932
WY     -1.005187 -0.741790  0.187125 -0.732845
OR     -1.382920  1.482495  0.961458 -2.141212
CO      0.992573  1.192241 -1.046780  1.292765

In [98]:
df

          W         X         Y         Z States
A  0.386030  2.084019 -0.376519  0.230336     CA
B  0.681209  1.035125 -0.031160  1.939932     NY
C -1.005187 -0.741790  0.187125 -0.732845     WY
D -1.382920  1.482495  0.961458 -2.141212     OR
E  0.992573  1.192241 -1.046780  1.292765     CO

In [99]:
df.set_index('States',inplace=True)

In [104]:
df

               W         X         Y         Z
States
CA      0.386030  2.084019 -0.376519  0.230336
NY      0.681209  1.035125 -0.031160  1.939932
WY     -1.005187 -0.741790  0.187125 -0.732845
OR     -1.382920  1.482495  0.961458 -2.141212
CO      0.992573  1.192241 -1.046780  1.292765

## DataFrame Summaries
There are a couple of ways to obtain summary data on DataFrames.<br>
<tt><strong>df.describe()</strong></tt> provides summary statistics on all numerical columns.<br>
<tt><strong>df.info and df.dtypes</strong></tt> displays the data type of all columns.

In [101]:
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean  -0.065659  1.010418 -0.061175  0.117795
std    1.060611  1.058227  0.738104  1.623276
min   -1.382920 -0.741790 -1.046780 -2.141212
25%   -1.005187  1.035125 -0.376519 -0.732845
50%    0.386030  1.192241 -0.031160  0.230336
75%    0.681209  1.482495  0.187125  1.292765
max    0.992573  2.084019  0.961458  1.939932

In [102]:
df.dtypes

W    float64
X    float64
Y    float64
Z    float64
dtype: object

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to CO
Data columns (total 4 columns):
W    5 non-null float64
X    5 non-null float64
Y    5 non-null float64
Z    5 non-null float64
dtypes: float64(4)
memory usage: 200.0+ bytes

# Great Job!